HELYXcore-4.4.0/examples/legacy/multiphase/potentialFreeSurfaceFoam/oscillatingBox/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0 0 0)
    (10 0 0)
    (10 1 0)
    ( 0 1 0)
    ( 0 0 0.1)
    (10 0 0.1)
    (10 1 0.1)
    ( 0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 20 1) simpleGrading (10 0.1 1)
);

edges
(
);

boundary
(
    freeSurface
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    floatingObject
    {
        type wall;
        faces
        (
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
