HELYXcore-4.4.0/examples/legacy/multiphase/potentialFreeSurfaceFoam/oscillatingBox/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.1 0.8 -100) (0.4 100 100);
        }
    }

    {
        name    c0;
        type    cellSet;
        action  invert;
    }

    {
        name    f0FaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   freeSurface;
        }
    }

    {
        name    f0FaceSet;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
            box (-100 0.9 -100) (0.2 100 100);
        }
    }

    {
        name    f0;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet    f0FaceSet;
        }
    }
);


// ************************************************************************* //
